RuanJG/stm32App/source/app/app_trex_v2.c
//packget body : result error value
#define USER_RES_CURRENT_FALSE_FLAG 1
#define USER_RES_VOICE_FALSE_FLAG 2
#define USER_RES_ERROR_FLAG 4

//work_mode value
#define USER_MODE_ONLINE 1
#define USER_MODE_OFFLINE 2
#define USER_MODE_SLAVER 3 


Uart_t *userUart=NULL;
protocol_t encoder;
protocol_t decoder;
volatile unsigned char userStation_mode;


#define ENABLE_REPORT_RESEND 0
#define REPORT_MAX_DATA_COUNT 100
volatile unsigned char report_buffer[REPORT_MAX_DATA_COUNT][15];
volatile unsigned int report_buffer_index;
volatile unsigned int report_buffer_sent_index;
volatile char report_listen_tag;
systick_time_t report_listen_timer;

volatile unsigned int report_ms;



void userStation_init()
{
	userUart = PC_UART;
	userStation_mode = USER_MODE_ONLINE;
	protocol_init( &encoder );
	protocol_init( &decoder );
	
	report_listen_tag = 0;
}

int userStation_send( unsigned char *data , int len)
{
	if( 1 == protocol_encode( &encoder, data, len ) ){
		Uart_Put_Sync( userUart , encoder.data, encoder.len );
		//USB_TxWrite( encoder.data, encoder.len );
		return 1;
	}else{
		return 0;
	}
}


unsigned char buffer[ 256 ];
void userStation_log( char * str ){
	
	if( strlen( str ) > sizeof(buffer) )
		return;
	
	buffer[0] = USER_LOG_TAG;
	memcpy( &buffer[1], str , strlen(str) );
	
	if( 0 == userStation_send( buffer, strlen(str)+1 ) ){
		_LOG("userStation_log: encode false");
	}
	
}



void userStation_report_resend_start()
{
	report_listen_tag = 1;
	systick_init_timer( &report_listen_timer , 500);
}


void userStation_reset_report()
{
	report_ms = systick_get_ms();
	report_buffer_index = 0;
	report_buffer_sent_index = 0;
	report_listen_tag = 0;
}

unsigned int userStation_get_report_ms()
{
	unsigned int ms;
	
	ms = systick_get_ms() - report_ms ;
	return ms;
}

void userStation_report(int db, float current, int switch_state)
{
	//tag[0]+db[0]db[1]db[2]db[3]+current[....]+work_current[0]+error[0]  ; work_counter is the count of the records
	
	unsigned int ms;
	
	if( report_buffer_index >= REPORT_MAX_DATA_COUNT ){ 
		if( switch_state == 0 )
		{
			report_buffer_index = REPORT_MAX_DATA_COUNT-1;
			if( report_buffer_sent_index >= report_buffer_index )
				report_buffer_sent_index = report_buffer_index;
		}else{
			return ;
		}
	}
	
	ms = userStation_get_report_ms();
	
	report_buffer[report_buffer_index][0]= USER_DATA_TAG;
	memcpy( &report_buffer[report_buffer_index][1], (unsigned char*) &ms, 4 ) ;
	memcpy( &report_buffer[report_buffer_index][5], (unsigned char*) &db, 4 ) ;
	memcpy( &report_buffer[report_buffer_index][9], (unsigned char*) &current , 4 ); 
	report_buffer[report_buffer_index][13]= report_buffer_index;
	report_buffer[report_buffer_index][14] = switch_state;
	
	//_LOG("report0: db=%d, current=%f , count=%d, sw=%d\n", db, current, report_buffer_index ,switch_state);
	//_LOG("report1: db=%d, current=%f , count=%d, sw=%d\n", db, current, report_buffer[report_buffer_index][13] ,report_buffer[report_buffer_index][14]);
	
	
	report_buffer_index++;
	
	
}


void userStation_report_send_event()
{
	
	if( report_listen_tag == 1 )
	{
		//in resend loop
		if( report_buffer_index > report_buffer_sent_index && 1 == systick_check_timer( &report_listen_timer ) )
		{
			_LOG("userStation_report_send_event: timeout->resend\n");
			userStation_log("userStation_report_send_event: timeout->resend \n");
			if( 0 == userStation_send( &report_buffer[report_buffer_sent_index][0], 15 ) ){
				_LOG("userStation_report_send_event: send false\n");
				userStation_log("userStation_report_send_event: send false\n");
			}
		}
		
	}else{
		
		if( report_buffer_index > report_buffer_sent_index ) 
		{
			
			if( 0 == userStation_send( &report_buffer[report_buffer_sent_index][0], 15 ) ){
				_LOG("userStation_report_send_event: send false\n");
				userStation_log("userStation_report_send_event: send false\n");
			}
			userStation_report_resend_start();
			//_LOG("send: index=%d, sw=%d\n", report_buffer[report_buffer_sent_index][13] ,report_buffer[report_buffer_sent_index][14]);
			
			report_buffer_sent_index++;
		}
		
	}
}



void userStation_send_config()
{
	unsigned char buffer[19];
	
	buffer[0]= USER_CONFIG_TAG;
	buffer[1] = g_config.config_avaliable; // 1 available
	memcpy( &buffer[2], (unsigned char*) &g_config.current_max, 4 ) ;
	memcpy( &buffer[6], (unsigned char*) &g_config.current_min , 4 ); 
	memcpy( &buffer[10], (unsigned char*) &g_config.db_max, 4 ) ;
	memcpy( &buffer[14], (unsigned char*) &g_config.db_min , 4 ); 
	buffer[18] = g_config.machine_no;
	
	if( 0 == userStation_send( buffer, sizeof(buffer) ) ){
		_LOG("send config false\n");
		userStation_log("send config false\n");
	}
}



void userStation_handleMsg( unsigned char *data, int len)
{
	int dbmin,dbmax;
	float cmax,cmin;
	unsigned char buffer[32]={0};
	
	switch( data[0] ){
		case USER_CMD_CHMOD_TAG:
			if( len == 2 ){
				userStation_mode = data[1];
			}
			break;
			
		case USER_CMD_CURRENT_MAXMIN_TAG:
			if( len == 9 ){
				memcpy( (char*)&cmax, data+1, 4);
				memcpy( (char*)&cmin, data+5, 4);
				g_config.current_max = cmax;
				g_config.current_min = cmin;
				config_save();
				userStation_send_config();
				sprintf((char*)buffer,"current=[%fA,%fA]",g_config.current_min, g_config.current_max);
				userStation_log( (char*) buffer );
			}
			break;
		
		case USER_CMD_VOICE_MAXMIN_TAG:
			if( len == 9 ){
				memcpy( (char*)&dbmax, data+1, 4);
				memcpy( (char*)&dbmin, data+5, 4);
				g_config.db_max = dbmax;
				g_config.db_min = dbmin;
				config_save();
				userStation_send_config();
				sprintf((char*)buffer,"db=[%d,%d]",g_config.db_min, g_config.db_max);
				userStation_log( (char*) buffer );
			}
			break;
			
		case USER_CMD_GET_MAXMIN_TAG:
			userStation_send_config();
			break;
		
		case USER_ACK_TAG:
			if( report_listen_tag == 1 )
				report_listen_tag = 0;
			break;
			
		case USER_CMD_SET_SW_STATUS_TAG:
			if( len == 2 ){
				if( userStation_mode == USER_MODE_SLAVER ){
					sw_on_tag = data[1];
				}
			}
			break;
			
		case USER_CMD_SET_MACHINE_NO:
			if( len == 2 ){
				g_config.machine_no = data[1];
				_LOG("set Machine No =%c\n",data[1]);
				config_save();
				userStation_send_config();
			}
			break;
		
		default:
			break;
	}
}


