RuanJG/stm32App/source/app/app_trex_v2.c
}


int service_getCurrent( float *A)
{
	int retry, len;
	
	//victor8165_check( "FUNC1?\n", "ADC\n");
	//if( victor8165_inited == 0 ||  0 == victor8165_check( "FUNC1?\n", "ADC\n") ){
	if( victor8165_inited == 0 ){
		_LOG("victor8165_getCurrent: need to init\n");
		victor8165_inited = 0;
		victor8165_init();
		return 0;
	}
	
	
	for( retry = 0; retry < 2; retry++ ){
		len = victor8165_cmd( "MEAS1?\n");
		if( len > 0 ) 
			break;
	}
	
	if( len == 0 ){
		return 0;
	}
	
	victor8165_buf[len] = 0; // set string end tag
	sscanf((const char*)victor8165_buf , "%e;\n",  A);
	//*mA = A*1000;
	
	return 1;
}


#endif





systick_time_t led_timer;
systick_time_t collect_timer;
systick_time_t work_timer;
volatile unsigned char server_status; // 0: idel ,  1:cail


void server_init()
{
	server_status =0;
	#if USING_VICTORMETER 
	victor8165_init();
	#endif
	#if USING_MINIMETER
	miniMeter_init();
	#endif
}

void server_start()
{
	unsigned char tag;
	
	userStation_reset_report();
	
	//delay for start read data
	systick_init_timer( &work_timer, 2500);


	tag = USER_START_TAG;	
	userStation_send( &tag , 1 );
	userStation_send_config();
	
	
	#if USING_VICTORMETER 
	if( 0 == victor8165_check( "FUNC1?\n", "ADC\n") ){
		_LOG("victor8165_getCurrent: need to init\n");
		victor8165_inited = 0;
		victor8165_init();
	}
	#endif
}

void server_stop()
{
	int i,error;
	float current;
	int db;
	
	
	#if USING_MINIMETER
	miniMeter_stop();
	#endif
	
	userStation_report( 0 , 0 ,0 );
	
}

void server_runtime()
{	
	int res;
	volatile int db;
	float current;
	
	if( 0 == systick_check_timer( &work_timer ) )
		return ;
	
	
	#if USING_MINIMETER
	if( 0 == miniMeter_start() ){
		_LOG(" miniMeter start error \n");
		userStation_log(" miniMeter start error \n");
	}
	#endif
	


	//get current by uart
	res = service_getCurrent( &current);
	if( -1 == res ){
		
		userStation_log("read current false");
		_LOG("read current false\n");
		
	}else if( 1 == res ){
		
		while( 1 ){
			db  = get_voice_db();
			if( db > 0 ) break;
		}
		userStation_report( db , current , sw_on_tag);
		
	}
	
	//will run this func after 10ms
	systick_init_timer( &work_timer, 5);
}

void server_event()
{
	if( sw_on_tag == 1 ){
		
		if( server_status == 0 ){
			server_start();
			server_status = 1;
		}
		if( server_status == 1 )
			server_runtime();
		
	}else{
		
		if( server_status == 1 ){
			server_stop();
			server_status = 0;
		}else if( server_status == 2){
			// has call server_stop , as collection has finish earlier
			server_status = 0;
		}else{
			server_status = 0;
		}
		
	}	
}






systick_time_t heart_led_timer;

void heart_led_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	systick_init_timer(&heart_led_timer, 1000);
	
}

void heart_led_even()
{
	static BitAction led = Bit_RESET;
	//static unsigned char tag = 0;
	//char buffer[32];
	
	if( systick_check_timer( &heart_led_timer ) ){
		GPIO_WriteBit( GPIOC, GPIO_Pin_13 , led);
		led = led==Bit_RESET ? Bit_SET: Bit_RESET ;
		//sprintf(buffer,"%d=sw:%d,ss:%d",tag++,sw_on_tag,server_status);
		//userStation_log(buffer);
		//tag %= 10;
	}		
}




systick_time_t user_station_loop_test_timer;

void user_station_loop_test_init()
{
	systick_init_timer(&user_station_loop_test_timer, 200);
	
}
volatile int testcount=0;

void user_station_loop_test_even()
{
	unsigned char tag;

	if( userStation_mode == USER_MODE_OFFLINE && systick_check_timer( &user_station_loop_test_timer ) ){
		if( testcount >= 50 ){
			userStation_report( 40, 0.444444 ,0 ); 
			testcount = 0;
		}else if( testcount == 0 ){
			//tag = USER_START_TAG;	
			//userStation_send( &tag , 1 );
			systick_delay_us(500000);
			userStation_reset_report();
			testcount ++;	
		}else{
			userStation_report( 40, 0.444444 ,1 );
			testcount ++;			
		}
	}		
}


void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;
		if( buffer[0] == '1' ){
			//sw_on_tag = 1;
			//userStation_report( 40, 0.44445 , 0, 0 );
		}else if( buffer[0] == '0' ){
			//sw_on_tag = 0;
			//userStation_report( 40, 0.444444 , 50, 0 ); 
		}
}





void app_init()
{
	Uart_init();

#if BOARD_HAS_IAP
	#if IAP_PORT_USB 
	iap_init_in_usb();
	#endif
	#if IAP_PORT_CAN1
	iap_init_in_can1();
	#endif
	#if  IAP_PORT_UART
	iap_init_in_uart( IAP_UART );
	#endif
#endif

	//console_init( CONSOLE_UART_TYPE ,CONSOLE_UART );
	console_init( CONSOLE_USB_TYPE ,NULL );
	

	ADC_Configuration ();
	led_pin_config();
	heart_led_init();
	switch_det_config();
	userStation_init();
	server_init();
	config_init();
	user_station_loop_test_init();
	//systick_delay_us(1000000);
	//miniMeter_start();

}





void app_event()
{
	#if 1
	if( userStation_mode == USER_MODE_ONLINE ){
		switch_det_event();
	}
	
	if( userStation_mode != USER_MODE_OFFLINE ){
		server_event();
	}
	
	userStation_listen_even();
	heart_led_even();
	
	//miniMeter_test_even();
	user_station_loop_test_even();
	//cmd_even();
	#endif
}

#endif